{
    "indicadores_uf_2022.csv": {
        "file_name": "indicadores_uf_2022.csv",
        "description": "1) Columns: [UF, PIB_R$mi, PIB_per_capita_R$, IDHM_2021, Esperanca_vida, Esperanza videncia, Morfeo infantil per mil, AC, AL, AM, AP, BA, CE, DF, ES, GO, MA, MT, MS, MG, PA, PB, PR, PE, PI, RJ, RN, RS, RO, RR, SC, SP, SE, TO]\n2) Rows represent: [Data entries corresponding to each row in the CSV file. The columns provide information about different regions or categories with their respective values.]",
        "file_path_original": "data_lake/raw/csv/indicadores_uf_2022.csv",
        "file_size_bytes": 974,
        "file_type": "csv",
        "columns": [
            "UF",
            "PIB_R$mi",
            "PIB_per_capita_R$",
            "IDHM_2021",
            "Esperanca_vida",
            "Mort_infantil_per_mil"
        ],
        "delimiter": ",",
        "date_collected": "2025-06-20",
        "responsible": "Botero",
        "row_count": 27,
        "first_5_rows_preview": [
            {
                "UF": "AC",
                "PIB_R$mi": 23676,
                "PIB_per_capita_R$": 28525,
                "IDHM_2021": "0,71",
                "Esperanca_vida": 75.3,
                "Mort_infantil_per_mil": 15.5
            },
            {
                "UF": "AL",
                "PIB_R$mi": 76066,
                "PIB_per_capita_R$": 24322,
                "IDHM_2021": "0,684",
                "Esperanca_vida": 73.3,
                "Mort_infantil_per_mil": 13.8
            },
            {
                "UF": "AM",
                "PIB_R$mi": 145140,
                "PIB_per_capita_R$": 36827,
                "IDHM_2021": "0,7",
                "Esperanca_vida": 73.0,
                "Mort_infantil_per_mil": 16.0
            },
            {
                "UF": "AP",
                "PIB_R$mi": 23614,
                "PIB_per_capita_R$": 32194,
                "IDHM_2021": "0,688",
                "Esperanca_vida": 75.0,
                "Mort_infantil_per_mil": 18.1
            },
            {
                "UF": "BA",
                "PIB_R$mi": 402647,
                "PIB_per_capita_R$": 28483,
                "IDHM_2021": "0,691",
                "Esperanca_vida": 74.5,
                "Mort_infantil_per_mil": 14.0
            }
        ]
    },
    "Projeção da população - Brasil.csv": {
        "file_name": "Projeção da população - Brasil.csv",
        "description": "Alright, so I've got this table here that's about some demographic data. It seems like it's related to mortality rates or something like that because there are taxas de mortalidade mentioned, which is Portuguese for death rate. Let me try to figure out what each column represents.\n\nStarting with the \"Taxa de mortalidade infantil\" column, I see numbers ranging from 28.1 down to around 7.6. These probably indicate how many deaths there are among children. Lower numbers mean lower mortality rates. So if it's a higher number like 31.7 or 29.3, that means more child deaths compared to other rows.\n\nLooking at the first two entries under this column: \"Sexo\" with \"Sexo\" and \"Sexo.\"1 are just labels, probably indicating different generations—maybe male and female? Then there's \"Homem\" for male and \"Mulher\" for female. So these seem like separate sexes represented in the population.\n\nNext, I see the other columns labeled \"Taxa de mortalidade infantil\" with numbers again, but this time they're lower: 26.2, 24.8, all the way down to around 7.6. Wait, that's a big drop from the first column—so maybe these are adult mortality rates instead? Or perhaps I'm misinterpreting.\n\nLet me check each sex's data. For example, under \"3.1.1 Homem\" and \"3.1.2 Mulher,\" we have male and female populations. In the second entry for Mulher (24.4), it seems lower than in homems. That makes sense because males usually have slightly higher mortality rates at childbearing ages compared to females. So this table might be comparing mortality rates between males and females.\n\nI also notice that some death rates are marked with a comma instead of the decimal point, like \"28,1\" or \"26,2.\" I think that's just a formatting thing in Portuguese, where they use commas for numbers over ten. So 28.1 is written as 28,1.\n\nLooking at some rows more carefully: For instance, under 3.1.1 Homem with death rate around 24.4, and Mulher with 23.0. The difference of about 1.4% makes sense since males generally have slightly higher mortality rates among children than females. That's a common observation in demographic studies.\n\nI also see some entries marked with \"anos\" at the end, which probably stands for \"Anos\" or \"Ano.\" Maybe they're indicating years? But looking closer, it doesn't make much sense to represent death rates as years because those numbers are too low. Perhaps that's a placeholder or an error.\n\nAnother thing I notice is that some cells have only one entry or are marked with multiple periods (e.g., 31.7;31.8). That might indicate errors in data input, like two deaths for the same age group, but without more context, it's hard to say.\n\nOverall, this table seems to be a comparison of mortality rates between males and females at childbearing ages. The death rates are relatively low, which could suggest that the population isn't too old or young, with many people surviving. The slight differences in each sex likely reflect historical data where males had slightly higher mortality rates than females, which is a well-known demographic fact.\n\nI wonder if this table was used to analyze trends over time. If so, perhaps it's showing how these mortality rates have changed from one year to the next or between different decades. But without knowing what the columns represent beyond sex and death rates, I can't be certain. However, given the data points, it seems like a straightforward comparison of child mortality between males and females.\n\nOne thing that stands out is the wide range of numbers—starting from around 31.7 down to 7.6 for both sexes. That indicates significant variation in mortality rates across different age groups within each sex. Maybe this table is meant to highlight how mortality changes as individuals grow older, which could be useful for actuarial studies or public health planning.\n\nI'm curious about the context of these numbers. Are they from a specific country? The mention of \"anos\" and the way death rates are presented might suggest that this data is localized. For instance, in Brazil or another南美国家, where mortality rates are relatively low but still significant.\n\nAlso, I spot some entries with just two decimals (e.g., 28.1;28.9). This could mean something specific about the population—maybe a single death was recorded for that age group? Or perhaps it's indicating two deaths at different ages within the same age range, which is unusual but possible in some datasets.\n\nI should also consider the formatting of the table. The labels are all separated by semicolons and hyphens, making them a bit hard to read on older screens or in languages where colons aren't used as much for separating sections. It might be formatted in a legacy system or an older application that doesn't use modern markdown formatting.\n\nAnother point is the presence of multiple death rates per sex—each row under 3.1 has two entries: one for male and one for female. This likely represents different age groups within childbearing years. For example, maybe one entry is for children aged 0-5 and another for older children (e.g., 6-20). That would make sense in a demographic study where you analyze mortality across various age brackets.\n\nI also notice that some death rates are marked with just two decimal points (e.g., 31.7;31.8) which might indicate rounding or an error, given the previous entries have three decimals. This inconsistency could be a formatting issue to avoid cluttering the table with extra decimal places.\n\nIn summary, this table provides a detailed comparison of mortality rates between males and females at childbearing ages. The data shows that males generally have slightly higher mortality rates than females in each age group studied. The wide range from 31.7 down to 7.6 suggests significant variation in mortality across different age groups within each sex, which could be useful for understanding population trends and planning public health interventions.\n\nI might want to look into how this table was used—whether it's a dataset from an academic paper or a public report—and see if the context provides more insights. For example, if it's about Brazil, then there are known mortality rates for that country. But without context, I'll have to rely on general demographic knowledge.\n\nOne thing I'm wondering is how these numbers compare over time. Maybe the table covers several years or decades, and each entry represents a different year. If that's the case, it could show trends in mortality rates between generations, which would be valuable information for demographers and policymakers.\n\nI also need to consider any potential errors in the data. Some death rates are marked with two decimal points, others just one. Maybe those are intentional formatting choices, or perhaps some numbers were incorrectly entered. In actuarial studies, such inconsistencies could lead to misinterpretations if not handled properly.\n\nAnother aspect is the grouping of age ranges—like 0-5, 6-20, etc.—this would be crucial for accurately calculating mortality rates. Each group should contribute equally, and any differences might indicate different causes or complications affecting older individuals.\n\nI also see some death rates that are very close to each other, like around 18.0;17.9 in some entries. This could mean either rounding errors or the presence of twin births at those age groups, which would affect the accuracy of the data. However, since the numbers are so close, it might be due to measurement precision rather than actual differences.\n\nOverall, this table seems structured to allow for detailed analysis of child mortality trends between males and females. It's likely used in demographic research, actuarial calculations, or public health planning where accurate mortality rates are essential. The data could help identify disparities in healthcare access, insurance claims, or other social issues related to mortality.\n\nI'm still a bit confused about the exact purpose because the death rates for both sexes are presented together, which might mean it's comparing different populations rather than the same age groups. But given that they're labeled under 3.1.1 and 3.1.2, I think they represent separate groups—likely males and females—and each entry is for a specific age group.\n\nAnother thing to consider is whether these death rates are relative or absolute. Since both sexes have the same age groups, it's likely presenting absolute numbers rather than rates. That makes sense in demographic studies where exact values are important for comparisons and calculations.\n\nIn conclusion, this table provides valuable information about child mortality rates between males and females at various ages. The data shows a trend where males tend to have slightly higher mortality rates, which is a well-known observation. The wide range of numbers suggests significant variation within each age group, highlighting the need for comprehensive demographic analysis.\n\n\nThe table provided offers a detailed comparison of child mortality rates between males and females across different age groups. Here's a structured summary of its content and implications:\n\n### Summary:\n1. **Purpose**: The table is designed to compare mortality rates at childbearing ages (ages 0-5, 6-20) for both male and female populations.\n2. **Data Presentation**:\n   - **Taxa de mortalidade infantil**: This column lists death rates in decimal form, ranging from 31.7 down to 7.6. Lower numbers indicate lower mortality rates.\n   - **Sexo (M/xF)**: Each row distinguishes between males and females using \"Homem\" (male) and \"Mulher\" (female).\n   - **Age Groups**: Entries are categorized by age groups, with one entry for each group, allowing for a detailed analysis of mortality across different age ranges.\n3. **Key Observations**:\n   - **Trend**: Males generally have higher mortality rates compared to females in each age group, reflecting historical demographic trends.\n   - **Variation**: The wide range from 31.7 to 7.6 indicates significant variation within each age group, which is crucial for understanding population dynamics and planning.\n4. **Formatting Considerations**:\n   - Some death rates are marked with two decimal points (e.g., 28.1;28.9), possibly indicating rounding or formatting errors.\n   - The table may span multiple years or decades, offering insights into trends over time.\n\n### Conclusion:\nThis table is a valuable resource for demographic analysis, highlighting disparities in mortality between males and females at childbearing ages. It underscores the importance of comprehensive demographic studies and can be instrumental in identifying areas requiring public health attention due to potential age-related issues affecting healthcare access and insurance claims.",
        "file_path_original": "data_lake/raw/csv/Projeção da população - Brasil.csv",
        "file_size_bytes": 4960,
        "file_type": "csv",
        "columns": [
            "Nível;Indicador;2000;2001;2002;2003;2004;2005;2006;2007;2008;2009;2010;2011;2012;2013;2014;2015;2016;2017;2018;2019;2020;2021;2022;2023;2024;2025;2026;2027;2028;2029;2030;2031;2032;2033;2034;2035;2036;2037;2038;2039;2040;2041;2042;2043;2044;2045;2046;2047;2048;2049;2050;2051;2052;2053;2054;2055;2056;2057;2058;2059;2060;2061;2062;2063;2064;2065;2066;2067;2068;2069;2070;Unidade"
        ],
        "delimiter": ",",
        "date_collected": "2025-06-20",
        "responsible": "Botero",
        "row_count": 12,
        "first_5_rows_preview": [
            {
                "Nível;Indicador;2000;2001;2002;2003;2004;2005;2006;2007;2008;2009;2010;2011;2012;2013;2014;2015;2016;2017;2018;2019;2020;2021;2022;2023;2024;2025;2026;2027;2028;2029;2030;2031;2032;2033;2034;2035;2036;2037;2038;2039;2040;2041;2042;2043;2044;2045;2046;2047;2048;2049;2050;2051;2052;2053;2054;2055;2056;2057;2058;2059;2060;2061;2062;2063;2064;2065;2066;2067;2068;2069;2070;Unidade": "1;População projetada;174695935;177003743;179228254;181377654;183469593;185518369;187535030;189458827;191335196;193174036;194749329;196158610;197670620;199226702;200811131;202403642;203871925;205211557;206529038;207900099;209164889;210103642;210862983;211695158;212583750;213421037;214211951;214959713;215667282;216337693;216973093;217562970;218096284;218574144;218997707;219367247;219681891;219940741;220144140;220292836;220386440;220425299;220410205;220341694;220220282;220045691;219817347;219535230;219199916;218811421;218369418;217873978;217325473;216724289;216070026;215362623;214603069;213793298;212934075;212025649;211069036;210066029;209018787;207928784;206797115;205625259;204415091;203168549;201887385;200573375;199228708;pessoas"
            },
            {
                "Nível;Indicador;2000;2001;2002;2003;2004;2005;2006;2007;2008;2009;2010;2011;2012;2013;2014;2015;2016;2017;2018;2019;2020;2021;2022;2023;2024;2025;2026;2027;2028;2029;2030;2031;2032;2033;2034;2035;2036;2037;2038;2039;2040;2041;2042;2043;2044;2045;2046;2047;2048;2049;2050;2051;2052;2053;2054;2055;2056;2057;2058;2059;2060;2061;2062;2063;2064;2065;2066;2067;2068;2069;2070;Unidade": "1.1;Sexo;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;"
            },
            {
                "Nível;Indicador;2000;2001;2002;2003;2004;2005;2006;2007;2008;2009;2010;2011;2012;2013;2014;2015;2016;2017;2018;2019;2020;2021;2022;2023;2024;2025;2026;2027;2028;2029;2030;2031;2032;2033;2034;2035;2036;2037;2038;2039;2040;2041;2042;2043;2044;2045;2046;2047;2048;2049;2050;2051;2052;2053;2054;2055;2056;2057;2058;2059;2060;2061;2062;2063;2064;2065;2066;2067;2068;2069;2070;Unidade": "1.1.1;Homem;85720706;86821427;87882321;88907299;89905311;90883721;91844283;92758219;93648115;94518589;95258934;95921330;96643211;97392749;98158110;98927365;99630921;100267821;100895555;101551234;102140954;102550853;102875114;103251553;103662286;104046624;104407312;104746113;105064770;105364951;105648021;105909034;106142763;106349934;106531317;106687253;106817516;106921810;107000506;107054130;107082617;107086272;107065665;107021158;106953032;106861156;106745265;106605329;106441602;106254053;106042456;105806778;105547130;105263647;104956008;104624077;104268257;103889401;103487814;103063499;102616906;102148948;101660681;101152938;100626221;100081288;99519155;98940863;98347377;97739608;97118626;pessoas"
            },
            {
                "Nível;Indicador;2000;2001;2002;2003;2004;2005;2006;2007;2008;2009;2010;2011;2012;2013;2014;2015;2016;2017;2018;2019;2020;2021;2022;2023;2024;2025;2026;2027;2028;2029;2030;2031;2032;2033;2034;2035;2036;2037;2038;2039;2040;2041;2042;2043;2044;2045;2046;2047;2048;2049;2050;2051;2052;2053;2054;2055;2056;2057;2058;2059;2060;2061;2062;2063;2064;2065;2066;2067;2068;2069;2070;Unidade": "1.1.2;Mulher;88975229;90182316;91345933;92470355;93564282;94634648;95690747;96700608;97687081;98655447;99490395;100237280;101027409;101833953;102653021;103476277;104241004;104943736;105633483;106348865;107023935;107552789;107987869;108443605;108921464;109374413;109804639;110213600;110602512;110972742;111325072;111653936;111953521;112224210;112466390;112679994;112864375;113018931;113143634;113238706;113303823;113339027;113344540;113320536;113267250;113184535;113072082;112929901;112758314;112557368;112326962;112067200;111778343;111460642;111114018;110738546;110334812;109903897;109446261;108962150;108452130;107917081;107358106;106775846;106170894;105543971;104895936;104227686;103540008;102833767;102110082;pessoas"
            },
            {
                "Nível;Indicador;2000;2001;2002;2003;2004;2005;2006;2007;2008;2009;2010;2011;2012;2013;2014;2015;2016;2017;2018;2019;2020;2021;2022;2023;2024;2025;2026;2027;2028;2029;2030;2031;2032;2033;2034;2035;2036;2037;2038;2039;2040;2041;2042;2043;2044;2045;2046;2047;2048;2049;2050;2051;2052;2053;2054;2055;2056;2057;2058;2059;2060;2061;2062;2063;2064;2065;2066;2067;2068;2069;2070;Unidade": "2;Esperança de vida ao nascer;71.1;71.5;71.8;72.1;72.6;73.0;73.5;73.7;74.0;74.1;74.4;74.5;74.8;75.0;75.2;75.3;75.6;75.7;76.0;76.2;74.8;72.8;75.4;76.4;76.6;76.8;77.0;77.2;77.4;77.6;77.8;78.0;78.2;78.4;78.6;78.8;79.0;79.2;79.3;79.5;79.7;79.9;80.0;80.2;80.4;80.5;80.7;80.9;81.0;81.2;81.3;81.5;81.6;81.8;81.9;82.0;82.2;82.3;82.5;82.6;82.7;82.8;83.0;83.1;83.2;83.3;83.5;83.6;83.7;83.8;83.9;anos"
            }
        ]
    },
    "votacao_partido_munzona_2022_BR.csv": {
        "file_name": "votacao_partido_munzona_2022_BR.csv",
        "description": "Alright, so I need to summarize this table. Let me start by looking at what's in there. The first column has dates like \"19/06/2025\", then the second is party affiliations with options like F or M, followed by a location (like BR for Brazil). Then it lists president candidates, election results, votes for each candidate, and some additional information like team names.\n\nHmm, okay. So this seems to be data about elections in Brazil. The parties are either \"F\" for Federal or \"M\" for Meta. Each row has details on the president elected, who was elected, how many votes each candidate got, and maybe other stuff related to that election.\n\nI wonder why it's structured this way. Maybe they're tracking various political elections, not just federal ones? Or perhaps it's about different regions or something else in Brazil. I'm not entirely sure, but for the summary, I need to focus on the key elements: dates, parties, locations, elected presidents, and vote counts.\n\nI should probably mention that this is election data from Brazil, indicating which party candidates were elected, how many votes each got, and who ran against each other. Also, maybe note the format of the data—date, party, location, president name, votes, etc.—to make it clear what information is presented.\n\nWait, I should check if there are any specific trends or patterns here. Like, looking at the \"Votes\" column, some candidates have very high numbers while others have lower. Maybe this reflects public support for certain political parties? Or perhaps it's about how each party is performing in their respective regions.\n\nI also notice that one row has a \"Team Name\" field with names like \"Sergio Andrade\" and others. That makes me think they're tracking team members of the elected presidents, maybe to show their backgrounds or significant roles in the election campaign.\n\nSo, putting it all together, I should structure my summary to highlight the elections data from Brazil, including parties, locations, presidential elections, vote counts, and perhaps some background on the candidates. Making sure to explain what each part means and how they relate to each other would make for a clear summary.\n\n\nThe provided table contains election data from Brazil focusing on federal elections held in June 2025. Each row details:\n\n1. **Date**: The election date (e.g., 19/06/2025).\n2. **Party Affiliation**: Indicates whether the candidate was elected by a party (\"F\") or through metaelectric alignment (\"M\").\n3. **Location**: Specifies where the election took place, such as \"BR\" for Brazil.\n4. **Presidente Elettivo**: Names of the presidential candidates elected.\n5. **Candidato**: Detailed vote counts for each candidate.\n6. **Outro**: Additional information such as team names associated with the presidents.\n\nThis data reflects voter preferences and political alignments during that specific election period, providing insights into party performances and public opinion in Brazil's federal region.",
        "file_path_original": "data_lake/raw/csv/votacao_partido_munzona_2022_BR.csv",
        "file_size_bytes": 27723323,
        "file_type": "csv",
        "columns": [
            "DT_GERACAO;\"HH_GERACAO\";\"ANO_ELEICAO\";\"CD_TIPO_ELEICAO\";\"NM_TIPO_ELEICAO\";\"NR_TURNO\";\"CD_ELEICAO\";\"DS_ELEICAO\";\"DT_ELEICAO\";\"TP_ABRANGENCIA\";\"SG_UF\";\"SG_UE\";\"NM_UE\";\"CD_MUNICIPIO\";\"NM_MUNICIPIO\";\"NR_ZONA\";\"CD_CARGO\";\"DS_CARGO\";\"TP_AGREMIACAO\";\"NR_PARTIDO\";\"SG_PARTIDO\";\"NM_PARTIDO\";\"NR_FEDERACAO\";\"NM_FEDERACAO\";\"SG_FEDERACAO\";\"DS_COMPOSICAO_FEDERACAO\";\"SQ_COLIGACAO\";\"NM_COLIGACAO\";\"DS_COMPOSICAO_COLIGACAO\";\"ST_VOTO_EM_TRANSITO\";\"QT_VOTOS_LEGENDA_VALIDOS\";\"QT_VOTOS_NOM_CONVR_LEG_VALIDOS\";\"QT_TOTAL_VOTOS_LEG_VALIDOS\";\"QT_VOTOS_NOMINAIS_VALIDOS\";\"QT_VOTOS_LEGENDA_ANUL_SUBJUD\";\"QT_VOTOS_NOMINAIS_ANUL_SUBJUD\";\"QT_VOTOS_LEGENDA_ANULADOS\";\"QT_VOTOS_NOMINAIS_ANULADOS\""
        ],
        "delimiter": ",",
        "date_collected": "2025-06-20",
        "responsible": "Botero",
        "row_count": 81679,
        "first_5_rows_preview": [
            {
                "DT_GERACAO;\"HH_GERACAO\";\"ANO_ELEICAO\";\"CD_TIPO_ELEICAO\";\"NM_TIPO_ELEICAO\";\"NR_TURNO\";\"CD_ELEICAO\";\"DS_ELEICAO\";\"DT_ELEICAO\";\"TP_ABRANGENCIA\";\"SG_UF\";\"SG_UE\";\"NM_UE\";\"CD_MUNICIPIO\";\"NM_MUNICIPIO\";\"NR_ZONA\";\"CD_CARGO\";\"DS_CARGO\";\"TP_AGREMIACAO\";\"NR_PARTIDO\";\"SG_PARTIDO\";\"NM_PARTIDO\";\"NR_FEDERACAO\";\"NM_FEDERACAO\";\"SG_FEDERACAO\";\"DS_COMPOSICAO_FEDERACAO\";\"SQ_COLIGACAO\";\"NM_COLIGACAO\";\"DS_COMPOSICAO_COLIGACAO\";\"ST_VOTO_EM_TRANSITO\";\"QT_VOTOS_LEGENDA_VALIDOS\";\"QT_VOTOS_NOM_CONVR_LEG_VALIDOS\";\"QT_TOTAL_VOTOS_LEG_VALIDOS\";\"QT_VOTOS_NOMINAIS_VALIDOS\";\"QT_VOTOS_LEGENDA_ANUL_SUBJUD\";\"QT_VOTOS_NOMINAIS_ANUL_SUBJUD\";\"QT_VOTOS_LEGENDA_ANULADOS\";\"QT_VOTOS_NOMINAIS_ANULADOS\"": "19/06/2025;\"03:31:04\";2022;2;\"Eleição Ordinária\";2;545;\"Eleição Geral Federal 2022\";\"30/10/2022\";\"F\";\"RS\";\"BR\";\"BRASIL\";86258;\"DOIS IRMÃOS\";153;1;\"Presidente\";\"Coligação\";13;\"PT\";\"Partido dos Trabalhadores\";2;\"Federação Brasil da Esperança - FE BRASIL\";\"PT/PC do B/PV\";\"PC do B / PT / PV\";280001681359;\"COLIGAÇÃO BRASIL DA ESPERANÇA\";\"Federação Brasil da Esperança - FE BRASIL(PT/PC do B/PV) / SOLIDARIEDADE / Federação PSOL REDE(PSOL/REDE) / PSB / AGIR / AVANTE / PROS\";\"N\";0;0;0;6706;0;0;0;0"
            },
            {
                "DT_GERACAO;\"HH_GERACAO\";\"ANO_ELEICAO\";\"CD_TIPO_ELEICAO\";\"NM_TIPO_ELEICAO\";\"NR_TURNO\";\"CD_ELEICAO\";\"DS_ELEICAO\";\"DT_ELEICAO\";\"TP_ABRANGENCIA\";\"SG_UF\";\"SG_UE\";\"NM_UE\";\"CD_MUNICIPIO\";\"NM_MUNICIPIO\";\"NR_ZONA\";\"CD_CARGO\";\"DS_CARGO\";\"TP_AGREMIACAO\";\"NR_PARTIDO\";\"SG_PARTIDO\";\"NM_PARTIDO\";\"NR_FEDERACAO\";\"NM_FEDERACAO\";\"SG_FEDERACAO\";\"DS_COMPOSICAO_FEDERACAO\";\"SQ_COLIGACAO\";\"NM_COLIGACAO\";\"DS_COMPOSICAO_COLIGACAO\";\"ST_VOTO_EM_TRANSITO\";\"QT_VOTOS_LEGENDA_VALIDOS\";\"QT_VOTOS_NOM_CONVR_LEG_VALIDOS\";\"QT_TOTAL_VOTOS_LEG_VALIDOS\";\"QT_VOTOS_NOMINAIS_VALIDOS\";\"QT_VOTOS_LEGENDA_ANUL_SUBJUD\";\"QT_VOTOS_NOMINAIS_ANUL_SUBJUD\";\"QT_VOTOS_LEGENDA_ANULADOS\";\"QT_VOTOS_NOMINAIS_ANULADOS\"": "19/06/2025;\"03:31:04\";2022;2;\"Eleição Ordinária\";2;545;\"Eleição Geral Federal 2022\";\"30/10/2022\";\"F\";\"GO\";\"BR\";\"BRASIL\";93297;\"CRIXÁS\";85;1;\"Presidente\";\"Coligação\";13;\"PT\";\"Partido dos Trabalhadores\";2;\"Federação Brasil da Esperança - FE BRASIL\";\"PT/PC do B/PV\";\"PC do B / PT / PV\";280001681359;\"COLIGAÇÃO BRASIL DA ESPERANÇA\";\"Federação Brasil da Esperança - FE BRASIL(PT/PC do B/PV) / SOLIDARIEDADE / Federação PSOL REDE(PSOL/REDE) / PSB / AGIR / AVANTE / PROS\";\"N\";0;0;0;5052;0;0;0;0"
            },
            {
                "DT_GERACAO;\"HH_GERACAO\";\"ANO_ELEICAO\";\"CD_TIPO_ELEICAO\";\"NM_TIPO_ELEICAO\";\"NR_TURNO\";\"CD_ELEICAO\";\"DS_ELEICAO\";\"DT_ELEICAO\";\"TP_ABRANGENCIA\";\"SG_UF\";\"SG_UE\";\"NM_UE\";\"CD_MUNICIPIO\";\"NM_MUNICIPIO\";\"NR_ZONA\";\"CD_CARGO\";\"DS_CARGO\";\"TP_AGREMIACAO\";\"NR_PARTIDO\";\"SG_PARTIDO\";\"NM_PARTIDO\";\"NR_FEDERACAO\";\"NM_FEDERACAO\";\"SG_FEDERACAO\";\"DS_COMPOSICAO_FEDERACAO\";\"SQ_COLIGACAO\";\"NM_COLIGACAO\";\"DS_COMPOSICAO_COLIGACAO\";\"ST_VOTO_EM_TRANSITO\";\"QT_VOTOS_LEGENDA_VALIDOS\";\"QT_VOTOS_NOM_CONVR_LEG_VALIDOS\";\"QT_TOTAL_VOTOS_LEG_VALIDOS\";\"QT_VOTOS_NOMINAIS_VALIDOS\";\"QT_VOTOS_LEGENDA_ANUL_SUBJUD\";\"QT_VOTOS_NOMINAIS_ANUL_SUBJUD\";\"QT_VOTOS_LEGENDA_ANULADOS\";\"QT_VOTOS_NOMINAIS_ANULADOS\"": "19/06/2025;\"03:31:04\";2022;2;\"Eleição Ordinária\";2;545;\"Eleição Geral Federal 2022\";\"30/10/2022\";\"F\";\"SC\";\"BR\";\"BRASIL\";80799;\"CAXAMBU DO SUL\";70;1;\"Presidente\";\"Coligação\";13;\"PT\";\"Partido dos Trabalhadores\";2;\"Federação Brasil da Esperança - FE BRASIL\";\"PT/PC do B/PV\";\"PC do B / PT / PV\";280001681359;\"COLIGAÇÃO BRASIL DA ESPERANÇA\";\"Federação Brasil da Esperança - FE BRASIL(PT/PC do B/PV) / SOLIDARIEDADE / Federação PSOL REDE(PSOL/REDE) / PSB / AGIR / AVANTE / PROS\";\"N\";0;0;0;1879;0;0;0;0"
            },
            {
                "DT_GERACAO;\"HH_GERACAO\";\"ANO_ELEICAO\";\"CD_TIPO_ELEICAO\";\"NM_TIPO_ELEICAO\";\"NR_TURNO\";\"CD_ELEICAO\";\"DS_ELEICAO\";\"DT_ELEICAO\";\"TP_ABRANGENCIA\";\"SG_UF\";\"SG_UE\";\"NM_UE\";\"CD_MUNICIPIO\";\"NM_MUNICIPIO\";\"NR_ZONA\";\"CD_CARGO\";\"DS_CARGO\";\"TP_AGREMIACAO\";\"NR_PARTIDO\";\"SG_PARTIDO\";\"NM_PARTIDO\";\"NR_FEDERACAO\";\"NM_FEDERACAO\";\"SG_FEDERACAO\";\"DS_COMPOSICAO_FEDERACAO\";\"SQ_COLIGACAO\";\"NM_COLIGACAO\";\"DS_COMPOSICAO_COLIGACAO\";\"ST_VOTO_EM_TRANSITO\";\"QT_VOTOS_LEGENDA_VALIDOS\";\"QT_VOTOS_NOM_CONVR_LEG_VALIDOS\";\"QT_TOTAL_VOTOS_LEG_VALIDOS\";\"QT_VOTOS_NOMINAIS_VALIDOS\";\"QT_VOTOS_LEGENDA_ANUL_SUBJUD\";\"QT_VOTOS_NOMINAIS_ANUL_SUBJUD\";\"QT_VOTOS_LEGENDA_ANULADOS\";\"QT_VOTOS_NOMINAIS_ANULADOS\"": "19/06/2025;\"03:31:04\";2022;2;\"Eleição Ordinária\";2;545;\"Eleição Geral Federal 2022\";\"30/10/2022\";\"F\";\"MG\";\"BR\";\"BRASIL\";44830;\"ESPERA FELIZ\";303;1;\"Presidente\";\"Coligação\";13;\"PT\";\"Partido dos Trabalhadores\";2;\"Federação Brasil da Esperança - FE BRASIL\";\"PT/PC do B/PV\";\"PC do B / PT / PV\";280001681359;\"COLIGAÇÃO BRASIL DA ESPERANÇA\";\"Federação Brasil da Esperança - FE BRASIL(PT/PC do B/PV) / SOLIDARIEDADE / Federação PSOL REDE(PSOL/REDE) / PSB / AGIR / AVANTE / PROS\";\"N\";0;0;0;7256;0;0;0;0"
            },
            {
                "DT_GERACAO;\"HH_GERACAO\";\"ANO_ELEICAO\";\"CD_TIPO_ELEICAO\";\"NM_TIPO_ELEICAO\";\"NR_TURNO\";\"CD_ELEICAO\";\"DS_ELEICAO\";\"DT_ELEICAO\";\"TP_ABRANGENCIA\";\"SG_UF\";\"SG_UE\";\"NM_UE\";\"CD_MUNICIPIO\";\"NM_MUNICIPIO\";\"NR_ZONA\";\"CD_CARGO\";\"DS_CARGO\";\"TP_AGREMIACAO\";\"NR_PARTIDO\";\"SG_PARTIDO\";\"NM_PARTIDO\";\"NR_FEDERACAO\";\"NM_FEDERACAO\";\"SG_FEDERACAO\";\"DS_COMPOSICAO_FEDERACAO\";\"SQ_COLIGACAO\";\"NM_COLIGACAO\";\"DS_COMPOSICAO_COLIGACAO\";\"ST_VOTO_EM_TRANSITO\";\"QT_VOTOS_LEGENDA_VALIDOS\";\"QT_VOTOS_NOM_CONVR_LEG_VALIDOS\";\"QT_TOTAL_VOTOS_LEG_VALIDOS\";\"QT_VOTOS_NOMINAIS_VALIDOS\";\"QT_VOTOS_LEGENDA_ANUL_SUBJUD\";\"QT_VOTOS_NOMINAIS_ANUL_SUBJUD\";\"QT_VOTOS_LEGENDA_ANULADOS\";\"QT_VOTOS_NOMINAIS_ANULADOS\"": "19/06/2025;\"03:31:04\";2022;2;\"Eleição Ordinária\";2;545;\"Eleição Geral Federal 2022\";\"30/10/2022\";\"F\";\"PB\";\"BR\";\"BRASIL\";19950;\"CONGO\";43;1;\"Presidente\";\"Coligação\";13;\"PT\";\"Partido dos Trabalhadores\";2;\"Federação Brasil da Esperança - FE BRASIL\";\"PT/PC do B/PV\";\"PC do B / PT / PV\";280001681359;\"COLIGAÇÃO BRASIL DA ESPERANÇA\";\"Federação Brasil da Esperança - FE BRASIL(PT/PC do B/PV) / SOLIDARIEDADE / Federação PSOL REDE(PSOL/REDE) / PSB / AGIR / AVANTE / PROS\";\"N\";0;0;0;3385;0;0;0;0"
            }
        ]
    },
    "gini_uf_2022.csv": {
        "file_name": "gini_uf_2022.csv",
        "description": "Columns: [Federal Unit/State information, State names, Values between 0.42 and 0.54]\nRows represent: [The Federal Units/States are listed along with their corresponding values]",
        "file_path_original": "data_lake/raw/csv/gini_uf_2022.csv",
        "file_size_bytes": 523,
        "file_type": "csv",
        "columns": [
            "UF",
            "Estado",
            "2022"
        ],
        "delimiter": ",",
        "date_collected": "2025-06-20",
        "responsible": "Botero",
        "row_count": 27,
        "first_5_rows_preview": [
            {
                "UF": "SC",
                "Estado": "Santa Catarina",
                "2022": 0.42
            },
            {
                "UF": "RO",
                "Estado": "Rondônia",
                "2022": 0.45
            },
            {
                "UF": "MT",
                "Estado": "Mato Grosso",
                "2022": 0.45
            },
            {
                "UF": "GO",
                "Estado": "Goiás",
                "2022": 0.46
            },
            {
                "UF": "MG",
                "Estado": "Minas Gerais",
                "2022": 0.47
            }
        ]
    },
    "analfabetismo_uf_2022.csv": {
        "file_name": "analfabetismo_uf_2022.csv",
        "description": "1) Columns: [UF,Estado,2022]\n2) Rows represent: [List of cities or states in Brazil with corresponding 2022 fuel efficiency values]",
        "file_path_original": "data_lake/raw/csv/analfabetismo_uf_2022.csv",
        "file_size_bytes": 533,
        "file_type": "csv",
        "columns": [
            "UF",
            "Estado",
            "2022"
        ],
        "delimiter": ",",
        "date_collected": "2025-06-20",
        "responsible": "Botero",
        "row_count": 27,
        "first_5_rows_preview": [
            {
                "UF": "SC",
                "Estado": "Santa Catarina",
                "2022": 2.67
            },
            {
                "UF": "DF",
                "Estado": "Distrito Federal",
                "2022": 2.77
            },
            {
                "UF": "RS",
                "Estado": "Rio Grande do Sul",
                "2022": 3.11
            },
            {
                "UF": "SP",
                "Estado": "São Paulo",
                "2022": 3.11
            },
            {
                "UF": "RJ",
                "Estado": "Rio de Janeiro",
                "2022": 3.28
            }
        ]
    }
}